Tekla.Structures.Forming.FormingStates
FormingStates class which contains different forming options.

Tekla.Structures.Forming.FormingStates.#ctor
Initializes a new instance of the Tekla.Structures.Forming.FormingStates class.

Tekla.Structures.Forming.FormingStates.#ctor(Tekla.Structures.Forming.DeformingType)
Initializes a new instance of the Tekla.Structures.Forming.FormingStates class.
deforming: Deforming type.

Tekla.Structures.Forming.FormingStates.#ctor(Tekla.Structures.Forming.FoldingType)
Initializes a new instance of the Tekla.Structures.Forming.FormingStates class.
folding: Folding type.

Tekla.Structures.Forming.FormingStates.#ctor(Tekla.Structures.Forming.WrappingType)
Initializes a new instance of the Tekla.Structures.Forming.FormingStates class.
wrapping: Wrapping type.

Tekla.Structures.Forming.FormingStates.#ctor(Tekla.Structures.Forming.DeformingType,Tekla.Structures.Forming.FoldingType,Tekla.Structures.Forming.WrappingType)
Initializes a new instance of the Tekla.Structures.Forming.FormingStates class.
deforming: Deforming type.
folding: Folding type.
wrapping: Wrapping type.

Tekla.Structures.Forming.FormingStates.Deforming
Gets or sets the deforming type.

Tekla.Structures.Forming.FormingStates.Folding
Gets or sets the folding type.

Tekla.Structures.Forming.FormingStates.Wrapping
Gets or sets the wrapping type.

Tekla.Structures.Forming.FormingStates.Clone
Method for cloning the current object.
Returns: Cloned object.